
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/14692765314)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
  * google_identity_platform_config.auth
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> "functions/src_b6fc7417eb56f45002fb75a6b35ea163.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> "functions/src_b6fc7417eb56f45002fb75a6b35ea163.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> "functions/src_b6fc7417eb56f45002fb75a6b35ea163.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_identity_platform_config.auth will be updated in-place
  ~ resource "google_identity_platform_config" "auth" {
        id                         = "projects/colomney-my-pet-melody-dev/config"
        name                       = "projects/409733918350/config"
        # (3 unchanged attributes hidden)

      ~ sign_in {
            # (2 unchanged attributes hidden)

          - email {
              - enabled           = false -> null
              - password_required = false -> null
            }

          - phone_number {
              - enabled            = false -> null
              - test_phone_numbers = {} -> null
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "27MZiw==" -> (known after apply)
      ~ detect_md5hash      = "ChXymbdvWlB8b9VbFLTEnA==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "ChXymbdvWlB8b9VbFLTEnA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_0a15f299b76f5a507c6fd55b14b4c49c.zip?generation=1741907908903505&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> "functions/src_b6fc7417eb56f45002fb75a6b35ea163.zip" # forces replacement
      ~ output_name         = "functions/src_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_0a15f299b76f5a507c6fd55b14b4c49c.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1691,"Program":"tfcmt","SHA1":"60d4329564f99dfd5c7bcb99c64fe014ff504c19","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->